#Дано целое число N (>0). Используя операции деления нацело и взятия остатка от
# деления. Найти количество и сумму его цифр
n = input("Введите целое число: ")
while True:
    try:
        n = int(n)
        if n < 10:
            print("Это не число!(От 10)")
            n = input("Введите целое число: ")
            continue
        break
    except ValueError:
        print("Ошибка ввода!")
        n = input("Введите целое число: ")

c = 0
summa = 0

while n > 0:
    y = n % 10  # БЕРЕМ ОСТАТОК ОТ ЧИСЛА N
    summa += y  # Добавляем цифру к общей сумме
    c += 1      # Увеличиваем счётчик количества цифр
    n = n // 10 # Отрезаем последнюю цифру

print(f"Количество цифр: {c}")
print(f"Сумма цифр: {summa}")




