# Вариант 5. Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними (S) км. Определить расстояние между ними через (T) часов, если автомобили первоначально
# движутся  навстречу друг другу. Данное расстояние равно модулю разности начального расстояния и общего пути, проделанного автомобилями; общий путь = время * суммарная скорость

v1 = input("Введите скорость первого авто (км/ч): ")
v2 = input("Введите скорость второго авто (км/ч): ")
s = input("Введите расстояние между автомобилями (км): ")
t = input("Введите время (час): ")
while type(v1) != float:
    try:
        v1 = float(v1)
    except ValueError:
        print("Ошибочка")
        v1 = input("Введите скорость первого авто (км/ч): ")
while type(v2) != float:
    try:
        v2 = float(v2)
    except ValueError:
        print("Ошибочка")
        v2 = input("Введите скорость второго авто (км/ч): ")
while type(s) != float:
    try:
        s = float(s)
    except ValueError:
        print("Ошибочка")
        s = input("Введите расстояние между автомобилями (км): ")
while type(t) != float:
    try:
        t = float(t)
    except ValueError:
        print("Ошибочка")
        t = input("Введите время (час): ")


full_s = t * (v1 + v2) #нашли полный путь
final_distance = (s - full_s) # финальное расстояние

print("Общий пройденный путь: " , full_s )
print("Финальное расстояние через" , t , "часа/часов")
