# Вариант 5. Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними (S) км. Определить расстояние между ними через (T) часов, если автомобили первоначально
# движутся  навстречу друг другу. Данное расстояние равно модулю разности начального расстояния и общего пути, проделанного автомобилями; общий путь = время * суммарная скорость

from sqlalchemy import except_
from wx.lib.masked import value

try:
    v1 = float(input("Введите скорость первого авто (км/ч)"))
    v2 = float(input("Введите скорость второго авто (км/ч)"))
    s = float(input("Введите расстояние между автомобилями (км)"))
    t = float(input("Введите время (час)"))

    full_s = t * (v1 + v2) #нашли полный путь
    final_distance = (s - full_s) # финальное расстояние

    print("Общий пройденный путь:" , full_s )
    print("Финальное расстояние через" , t , "часа/часов")
except ValueError:
    print("Ошибка")
